app/Http/Controllers/AdminController.php

    public function admin_dashboard(Request $request)
    {

        $root_categories = Category::where('level', 0)->get();

        $data['cached_graph_data'] = Cache::remember('cached_graph_data', 86400, function () use ($root_categories) {
            $num_of_sale_data = null;
            $qty_data = null;
            foreach ($root_categories as $key => $category) {
                $category_ids = \App\Utility\CategoryUtility::children_ids($category->id);
                $category_ids[] = $category->id;

                $products = Product::with('stocks')->whereIn('category_id', $category_ids)->get();
---
select * from `categories` where `level` = 0
select * from `products` where `category_id` in (1)


        $data['root_categories'] = $root_categories;

        $data['total_customers'] = User::where('user_type', 'customer')->where('email_verified_at', '!=', null)->count();
        $data['top_customers'] = User::select('users.id', 'users.name', 'users.avatar_original', DB::raw('SUM(grand_total) as total'))
            ->join('orders', 'orders.user_id', '=', 'users.id')
            ->groupBy('orders.user_id')
            ->where('users.user_type', 'customer')
            ->orderBy('total', 'desc')
            ->limit(6)
            ->get();
        $data['total_products'] = Product::where('approved', 1)->where('published', 1)->count();
        $data['total_inhouse_products'] = Product::where('approved', 1)->where('published', 1)->where('added_by', 'admin')->count();
        $data['total_sellers_products'] = Product::where('approved', 1)->where('published', 1)->where('added_by', '!=', 'admin')->count();
        $data['total_categories'] = Category::count();
---
select count(*) as aggregate from `users` where `user_type` = 'customer' and `email_verified_at` is not null
select `users`.`id`, `users`.`name`, `users`.`avatar_original`, SUM(grand_total) as total from `users` inner join `orders` on `orders`.`user_id` = `users`.`id` where `users`.`user_type` = 'customer' group by `orders`.`user_id` order by `total` desc limit 6
select count(*) as aggregate from `products` where `approved` = 1 and `published` = 1
select count(*) as aggregate from `products` where `approved` = 1 and `published` = 1 and `added_by` = 'admin'
select count(*) as aggregate from `products` where `approved` = 1 and `published` = 1 and `added_by` != 'admin'
select count(*) as aggregate from `categories`

            } catch (\Throwable $th) {
            }
        }
        $data['top_categories'] = Product::select('categories.name', 'categories.id', DB::raw('SUM(grand_total) as total'))
            ->leftJoin('order_details', 'order_details.product_id', '=', 'products.id')
            ->leftJoin('orders', 'orders.id', '=', 'order_details.order_id')
            ->leftJoin('categories', 'products.category_id', '=', 'categories.id')
            ->where('orders.delivery_status', 'delivered')
            ->groupBy('categories.id')
            ->orderBy('total', 'desc')
            ->limit(3)
            ->get();
        $data['total_brands'] = Brand::count();
        $data['top_brands'] = Product::select('brands.name', 'brands.id', DB::raw('SUM(grand_total) as total'))
            ->leftJoin('order_details', 'order_details.product_id', '=', 'products.id')
            ->leftJoin('orders', 'orders.id', '=', 'order_details.order_id')
            ->leftJoin('brands', 'products.brand_id', '=', 'brands.id')
            ->where('orders.delivery_status', 'delivered')
            ->groupBy('brands.id')
            ->orderBy('total', 'desc')
            ->limit(3)
            ->get();
        $data['total_sale'] = Order::where('delivery_status', 'delivered')->sum('grand_total');
        $data['sale_this_month'] = Order::whereMonth('created_at', Carbon::now()->month)->sum('grand_total');
        $data['admin_sale_this_month'] = Order::select(DB::raw('COALESCE(users.user_type, "admin") as user_type'), DB::raw('COALESCE(SUM(grand_total), 0) as total_sale'))
            ->leftJoin('users', 'orders.seller_id', '=', 'users.id')
            ->whereRaw('users.user_type = "admin"')
            ->whereMonth('orders.created_at', Carbon::now()->month)
            ->first();
        $data['seller_sale_this_month'] = Order::select(DB::raw('COALESCE(users.user_type, "seller") as user_type'), DB::raw('COALESCE(SUM(grand_total), 0) as total_sale'))
            ->leftJoin('users', 'orders.seller_id', '=', 'users.id')
            ->whereRaw('users.user_type = "seller"')
            ->whereMonth('orders.created_at', Carbon::now()->month)
            ->first();
---
select `categories`.`name`, `categories`.`id`, SUM(grand_total) as total from `products` left join `order_details` on `order_details`.`product_id` = `products`.`id` left join `orders` on `orders`.`id` = `order_details`.`order_id` left join `categories` on `products`.`category_id` = `categories`.`id` where `orders`.`delivery_status` = 'delivered' group by `categories`.`id` order by `total` desc limit 3
select count(*) as aggregate from `brands`
select `brands`.`name`, `brands`.`id`, SUM(grand_total) as total from `products` left join `order_details` on `order_details`.`product_id` = `products`.`id` left join `orders` on `orders`.`id` = `order_details`.`order_id` left join `brands` on `products`.`brand_id` = `brands`.`id` where `orders`.`delivery_status` = 'delivered' group by `brands`.`id` order by `total` desc limit 3
select sum(`grand_total`) as aggregate from `orders` where `delivery_status` = 'delivered'
select sum(`grand_total`) as aggregate from `orders` where month(`created_at`) = '06'
select COALESCE(users.user_type, "admin") as user_type, COALESCE(SUM(grand_total), 0) as total_sale from `orders` left join `users` on `orders`.`seller_id` = `users`.`id` where users.user_type = "admin" and month(`orders`.`created_at`) = '06' limit 1
select COALESCE(users.user_type, "seller") as user_type, COALESCE(SUM(grand_total), 0) as total_sale from `orders` left join `users` on `orders`.`seller_id` = `users`.`id` where users.user_type = "seller" and month(`orders`.`created_at`) = '06' limit 1

        $data['sales_stat'] = $new_stat;
        // dd($sales_stat);
        // "SELECT users.user_type, SUM(grand_total) FROM `orders` LEFT JOIN users ON orders.seller_id = users.id WHERE users.user_type = 'admin' OR users.user_type = 'seller' GROUP BY users.user_type, MONTH(orders.created_at)";
        $data['total_sellers'] = User::where('user_type', 'seller')->where('email_verified_at', '!=', null)->count();
        $data['status_wise_sellers'] = Shop::select('verification_status', DB::raw('COUNT(*) as total'))
            ->whereIn('user_id', function ($q){
                $q->select('id')
                    ->from(with(new User)->getTable())
                    ->where('email_verified_at', '!=', null);
            })
            ->groupBy('verification_status')
            ->get();
        $data['top_sellers'] = Order::select('orders.seller_id', 'users.name', 'users.user_type', 'users.avatar_original', DB::raw('SUM(grand_total) as total'))
            ->leftJoin('users', 'orders.seller_id', '=', 'users.id')
            ->whereRaw('users.user_type = "seller"')
            ->groupBy('users.id')
            ->orderBy('total', 'desc')
            ->limit(6)
            ->get();
        $data['total_order'] = Order::count();
        $data['total_placed_order'] = Order::where('delivery_status', '!=', 'cancelled')->count();
        $data['total_pending_order'] = Order::where('delivery_status', 'pending')->count();
        $data['total_confirmed_order'] = Order::where('delivery_status', 'confirmed')->count();
        $data['total_picked_up_order'] = Order::where('delivery_status', 'picked_up')->count();
        $data['total_shipped_order'] = Order::where('delivery_status', 'on_the_way')->count();
        $admin_id = User::select('id')->where('user_type', 'admin')->first()->id;
        $data['total_inhouse_sale'] = Order::where("seller_id", $admin_id)->sum('grand_total');
        $data['payment_type_wise_inhouse_sale'] = Order::select(DB::raw('case
                                                    when payment_type in ("wallet") then "wallet"
                                                    when payment_type NOT in ("cash_on_delivery") then "others"
                                                    else cast(payment_type as char)
                                                    end as payment_type, SUM(grand_total)  as total_amount'),)
            ->where("user_id", '!=', null)
            ->where("seller_id", $admin_id)
            ->groupBy(DB::raw('1'))
            ->get();
        $data['inhouse_product_rating'] = Product::where('added_by', 'admin')->where('rating', '!=', 0)->avg('rating');
        $data['total_inhouse_order'] = Order::where("seller_id", $admin_id)->count();
---
select count(*) as aggregate from `users` where `user_type` = 'seller' and `email_verified_at` is not null
select `verification_status`, COUNT(*) as total from `shops` where `user_id` in (select `id` from `users` where `email_verified_at` is not null) group by `verification_status`
select `orders`.`seller_id`, `users`.`name`, `users`.`user_type`, `users`.`avatar_original`, SUM(grand_total) as total from `orders` left join `users` on `orders`.`seller_id` = `users`.`id` where users.user_type = "seller" group by `users`.`id` order by `total` desc limit 6
select count(*) as aggregate from `orders`
select count(*) as aggregate from `orders` where `delivery_status` != 'cancelled'
select count(*) as aggregate from `orders` where `delivery_status` = 'pending'
select count(*) as aggregate from `orders` where `delivery_status` = 'confirmed'
select count(*) as aggregate from `orders` where `delivery_status` = 'picked_up'
select count(*) as aggregate from `orders` where `delivery_status` = 'on_the_way'
select `id` from `users` where `user_type` = 'admin' limit 1
select sum(`grand_total`) as aggregate from `orders` where `seller_id` = 9
select case
when payment_type in ("wallet") then "wallet"
when payment_type NOT in ("cash_on_delivery") then "others"
else cast(payment_type as char)
end as payment_type, SUM(grand_total)  as total_amount from `orders` where `user_id` is not null and `seller_id` = 9 group by 1
select avg(`rating`) as aggregate from `products` where `added_by` = 'admin' and `rating` != 0
select count(*) as aggregate from `orders` where `seller_id` = 9

    public function inhouse_top_categories(Request $request)
    {
        $inhouse_top_category_query = Order::query();
        $inhouse_top_category_query->select('categories.id', 'categories.name', 'categories.cover_image', DB::raw('SUM(order_details.price + order_details.tax) as total'))
            ->leftJoin('order_details', 'orders.id', '=', 'order_details.order_id')
            ->leftJoin('products', 'order_details.product_id', '=', 'products.id')
            ->leftJoin('categories', 'products.category_id', '=', 'categories.id')
            ->where('orders.delivery_status', '=', 'delivered')
            ->whereRaw('products.added_by = "admin"');
        if ($request->interval_type != 'all') {
            $inhouse_top_category_query->where('orders.created_at', '>=', DB::raw('DATE_SUB(NOW(), INTERVAL 1 ' . $request->interval_type . ')'));
        }
        $inhouse_top_categories = $inhouse_top_category_query->groupBy('categories.name')
            ->orderBy('total', 'desc')
            ->limit(5)
            ->get();
---
select `categories`.`id`, `categories`.`name`, `categories`.`cover_image`, SUM(order_details.price + order_details.tax) as total from `orders` left join `order_details` on `orders`.`id` = `order_details`.`order_id` left join `products` on `order_details`.`product_id` = `products`.`id` left join `categories` on `products`.`category_id` = `categories`.`id` where `orders`.`delivery_status` = 'delivered' and products.added_by = "admin" group by `categories`.`name` order by `total` desc limit 5

    public function inhouse_top_brands(Request $request)
    {
        $inhouse_top_brand_query = Order::query();
        $inhouse_top_brand_query->select('brands.id', 'brands.name', 'brands.logo', DB::raw('SUM(order_details.price + order_details.tax) as total'))
            ->leftJoin('order_details', 'orders.id', '=', 'order_details.order_id')
            ->leftJoin('products', 'order_details.product_id', '=', 'products.id')
            ->leftJoin('brands', 'products.brand_id', '=', 'brands.id')
            ->where('orders.delivery_status', '=', 'delivered')
            ->where('products.brand_id', '!=', null)
            ->whereRaw('products.added_by = "admin"');
        if ($request->interval_type != 'all') {
            $inhouse_top_brand_query->where('orders.created_at', '>=', DB::raw('DATE_SUB(NOW(), INTERVAL 1 ' . $request->interval_type . ')'));
        }
        $inhouse_top_brands = $inhouse_top_brand_query->groupBy('brands.name')
            ->orderBy('total', 'desc')
            ->limit(5)
            ->get();
---
select `brands`.`id`, `brands`.`name`, `brands`.`logo`, SUM(order_details.price + order_details.tax) as total from `orders` left join `order_details` on `orders`.`id` = `order_details`.`order_id` left join `products` on `order_details`.`product_id` = `products`.`id` left join `brands` on `products`.`brand_id` = `brands`.`id` where `orders`.`delivery_status` = 'delivered' and `products`.`brand_id` is not null and products.added_by = "admin" group by `brands`.`name` order by `total` desc limit 5