app/Http/Controllers/BusinessSettingsController.php

    public function google_map_update(Request $request)
    {
        foreach ($request->types as $key => $type) {
            $this->overWriteEnvFile($type, $request[$type]);
        }

        $business_settings = BusinessSetting::where('type', 'google_map')->first();

        if ($request->has('google_map')) {
            $business_settings->value = 1;
            $business_settings->save();
---
select * from `business_settings` where `type` = 'google_map' limit 1
update `business_settings` set `value` = 1, `business_settings`.`updated_at` = '2024-06-03 10:55:32' where `id` = 117