app/Http/Controllers/ProductController.php

    public function admin_products(Request $request)
    {


        $type = 'In House';
        $col_name = null;
        $query = null;
        $sort_search = null;

        $products = Product::where('added_by', 'admin')->where('auction_product', 0)->where('wholesale_product', 0);

        if ($request->type != null) {
            $var = explode(",", $request->type);
            $col_name = $var[0];
            $query = $var[1];
            $products = $products->orderBy($col_name, $query);
            $sort_type = $request->type;
        }
        if ($request->search != null) {
            $sort_search = $request->search;
            $products = $products
                ->where('name', 'like', '%' . $sort_search . '%')
                ->orWhereHas('stocks', function ($q) use ($sort_search) {
                    $q->where('sku', 'like', '%' . $sort_search . '%');
                });
        }

        $products = $products->where('digital', 0)->orderBy('created_at', 'desc')->paginate(15);
---
select * from `products` where `added_by` = 'admin' and `auction_product` = 0 and `wholesale_product` = 0 and `digital` = 0 order by `created_at` desc limit 15 offset 0
select count(*) as aggregate from `products` where `added_by` = 'admin' and `auction_product` = 0 and `wholesale_product` = 0 and `digital` = 0

    public function seller_products(Request $request, $product_type)
    {
        $col_name = null;
        $query = null;
        $seller_id = null;
        $sort_search = null;
        $products = Product::where('added_by', 'seller')->where('auction_product', 0)->where('wholesale_product', 0);
        if ($request->has('user_id') && $request->user_id != null) {
            $products = $products->where('user_id', $request->user_id);
            $seller_id = $request->user_id;
        }
        if ($request->search != null) {
            $products = $products
                ->where('name', 'like', '%' . $request->search . '%');
            $sort_search = $request->search;
        }
        if ($request->type != null) {
            $var = explode(",", $request->type);
            $col_name = $var[0];
            $query = $var[1];
            $products = $products->orderBy($col_name, $query);
            $sort_type = $request->type;
        }
        $products = $product_type == 'physical' ? $products->where('digital', 0) : $products->where('digital', 1);
        $products = $products->orderBy('created_at', 'desc')->paginate(15);
---
select count(*) as aggregate from `products` where `added_by` = 'seller' and `auction_product` = 0 and `wholesale_product` = 0 and `digital` = 1

    public function all_products(Request $request)
    {
        $col_name = null;
        $query = null;
        $seller_id = null;
        $sort_search = null;
        $products = Product::where('auction_product', 0)->where('wholesale_product', 0);
        if (get_setting('vendor_system_activation') != 1) {
            $products = $products->where('added_by', 'admin');
        }
        if ($request->has('user_id') && $request->user_id != null) {
            $products = $products->where('user_id', $request->user_id);
            $seller_id = $request->user_id;
        }
        if ($request->search != null) {
            $sort_search = $request->search;
            $products = $products
                ->where('name', 'like', '%' . $sort_search . '%')
                ->orWhereHas('stocks', function ($q) use ($sort_search) {
                    $q->where('sku', 'like', '%' . $sort_search . '%');
                });
        }
        if ($request->type != null) {
            $var = explode(",", $request->type);
            $col_name = $var[0];
            $query = $var[1];
            $products = $products->orderBy($col_name, $query);
            $sort_type = $request->type;
        }

        $products = $products->orderBy('created_at', 'desc')->paginate(15);
---
select * from `products` where `auction_product` = 0 and `wholesale_product` = 0 order by `created_at` desc limit 15 offset 0
select count(*) as aggregate from `products` where `auction_product` = 0 and `wholesale_product` = 0

    public function create()
    {


        $categories = Category::where('parent_id', 0)
            ->where('digital', 0)
            ->with('childrenCategories')
            ->get();
---
select * from `categories` where `categories`.`parent_id` in (1, 2, 3)

    public function store(ProductRequest $request)
    {
        $product = $this->productService->store($request->except([
            '_token', 'sku', 'choice', 'tax_id', 'tax', 'tax_type', 'flash_deal_id', 'flash_discount', 'flash_discount_type'
        ]));
        $request->merge(['product_id' => $product->id]);

        //Product categories
        $product->categories()->attach($request->category_ids);
---
insert into `product_categories` (`category_id`, `product_id`) values ('1', 2)


        // Product Translations
        $request->merge(['lang' => env('DEFAULT_LANGUAGE')]);
        ProductTranslation::create($request->only([
            'lang', 'name', 'unit', 'description', 'product_id'
        ]));
---
insert into `product_translations` (`lang`, `name`, `unit`, `description`, `product_id`, `updated_at`, `created_at`) values ('en', 'test', 'pc', '', 2, '2024-06-03 11:02:06', '2024-06-03 11:02:06')

    public function admin_product_edit(Request $request, $id)
    {


        $product = Product::findOrFail($id);
        if ($product->digital == 1) {
            return redirect('admin/digitalproducts/' . $id . '/edit');
        }

        $lang = $request->lang;
        $tags = json_decode($product->tags);
        $categories = Category::where('parent_id', 0)
            ->where('digital', 0)
            ->with('childrenCategories')
            ->get();
---
select * from `products` where `products`.`id` = '1' limit 1
select * from `categories` where `categories`.`parent_id` in (1, 2, 3)

    public function update(ProductRequest $request, Product $product)
    {
        //Product
        $product = $this->productService->update($request->except([
            '_token', 'sku', 'choice', 'tax_id', 'tax', 'tax_type', 'flash_deal_id', 'flash_discount', 'flash_discount_type'
        ]), $product);

        $request->merge(['product_id' => $product->id]);

        //Product categories
        $product->categories()->sync($request->category_ids);


        //Product Stock
        $product->stocks()->delete();
        $this->productStockService->store($request->only([
            'colors_active', 'colors', 'choice_no', 'unit_price', 'sku', 'current_stock', 'product_id'
        ]), $product);

        //Flash Deal
        $this->productFlashDealService->store($request->only([
            'flash_deal_id', 'flash_discount', 'flash_discount_type'
        ]), $product);

        //VAT & Tax
        if ($request->tax_id) {
            $product->taxes()->delete();
---
delete from `product_stocks` where `product_stocks`.`product_id` = 1 and `product_stocks`.`product_id` is not null
delete from `product_taxes` where `product_taxes`.`product_id` = 1 and `product_taxes`.`product_id` is not null

        }

        // Frequently Brought Products
        $product->frequently_brought_products()->delete();
---
delete from `frequently_brought_products` where `frequently_brought_products`.`product_id` = 1 and `frequently_brought_products`.`product_id` is not null

        ]));

        // Product Translations
        ProductTranslation::updateOrCreate(
            $request->only([
                'lang', 'product_id'
            ]),
            $request->only([
                'name', 'unit', 'description'
            ])
        );
---
select * from `product_translations` where (`lang` = 'en' and `product_id` = 1) limit 1

    public function sku_combination_edit(Request $request)
    {
        $product = Product::findOrFail($request->id);
---
select * from `products` where `products`.`id` = '1' limit 1